TMS320C2000 Assembler Unix v21.6.0 Tue May  9 11:00:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                           Unix v21.6.0.LTS *
       3              ;* Date/Time created: Tue May  9 11:00:04 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sfra_gui_scicomms_driverlib.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen Unix v21.6.0.LTS Copyright (c) 1996
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/RE
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    5619                      .dwattr $C$DW$T$24, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c
    5620                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x7b)
    5621                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    5622                      .dwendtag $C$DW$T$24
    5623              
    5624                      .dwendtag $C$DW$TU$24
    5625              
    5626              
    5627              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5628                      .dwmtype  $C$DW$T$25
    5629              $C$DW$T$25      .dwtag  DW_TAG_typedef
    5630                      .dwattr $C$DW$T$25, DW_AT_name("GPIO_Direction")
    5631                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    5632                      .dwattr $C$DW$T$25, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c
    5633                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x7e)
    5634                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    5635              
    5636                      .dwendtag $C$DW$TU$25
    5637              
    5638              
    5639              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5640                      .dwmtype  $C$DW$T$26
    5641              
    5642              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    5643                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5644              $C$DW$312       .dwtag  DW_TAG_enumerator
    5645                      .dwattr $C$DW$312, DW_AT_name("GPIO_QUAL_SYNC")
    5646                      .dwattr $C$DW$312, DW_AT_const_value(0x00)
    5647                      .dwattr $C$DW$312, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c2
    5648                      .dwattr $C$DW$312, DW_AT_decl_line(0x95)
    5649                      .dwattr $C$DW$312, DW_AT_decl_column(0x05)
    5650              
    5651              $C$DW$313       .dwtag  DW_TAG_enumerator
    5652                      .dwattr $C$DW$313, DW_AT_name("GPIO_QUAL_3SAMPLE")
    5653                      .dwattr $C$DW$313, DW_AT_const_value(0x01)
    5654                      .dwattr $C$DW$313, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c2
    5655                      .dwattr $C$DW$313, DW_AT_decl_line(0x96)
    5656                      .dwattr $C$DW$313, DW_AT_decl_column(0x05)
    5657              
    5658              $C$DW$314       .dwtag  DW_TAG_enumerator
    5659                      .dwattr $C$DW$314, DW_AT_name("GPIO_QUAL_6SAMPLE")
    5660                      .dwattr $C$DW$314, DW_AT_const_value(0x02)
TMS320C2000 Assembler Unix v21.6.0 Tue May  9 11:00:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  110

    5661                      .dwattr $C$DW$314, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c2
    5662                      .dwattr $C$DW$314, DW_AT_decl_line(0x97)
    5663                      .dwattr $C$DW$314, DW_AT_decl_column(0x05)
    5664              
    5665              $C$DW$315       .dwtag  DW_TAG_enumerator
    5666                      .dwattr $C$DW$315, DW_AT_name("GPIO_QUAL_ASYNC")
    5667                      .dwattr $C$DW$315, DW_AT_const_value(0x03)
    5668                      .dwattr $C$DW$315, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c2
    5669                      .dwattr $C$DW$315, DW_AT_decl_line(0x98)
    5670                      .dwattr $C$DW$315, DW_AT_decl_column(0x05)
    5671              
    5672                      .dwattr $C$DW$T$26, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c
    5673                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x94)
    5674                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5675                      .dwendtag $C$DW$T$26
    5676              
    5677                      .dwendtag $C$DW$TU$26
    5678              
    5679              
    5680              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5681                      .dwmtype  $C$DW$T$27
    5682              $C$DW$T$27      .dwtag  DW_TAG_typedef
    5683                      .dwattr $C$DW$T$27, DW_AT_name("GPIO_QualificationMode")
    5684                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5685                      .dwattr $C$DW$T$27, DW_AT_decl_file("/Applications/ti/ccs1120/C2000Ware_DigitalPower_SDK_4_00_00_00/c
    5686                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x99)
    5687                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5688              
    5689                      .dwendtag $C$DW$TU$27
    5690              
    5691              
    5692              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    5693                      .dwmtype  $C$DW$T$23
    5694              
    5695              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5696                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    5697              $C$DW$316       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    5699                      .dwattr $C$DW$316, DW_AT_name("h_magVect")
    5700                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5701                      .dwattr $C$DW$316, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5702                      .dwattr $C$DW$316, DW_AT_decl_line(0x40)
    5703                      .dwattr $C$DW$316, DW_AT_decl_column(0x10)
    5704              
    5705              $C$DW$317       .dwtag  DW_TAG_member
    5706                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
    5707                      .dwattr $C$DW$317, DW_AT_name("h_phaseVect")
    5708                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5709                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5710                      .dwattr $C$DW$317, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5711                      .dwattr $C$DW$317, DW_AT_decl_line(0x41)
    5712                      .dwattr $C$DW$317, DW_AT_decl_column(0x10)
    5713              
    5714              $C$DW$318       .dwtag  DW_TAG_member
    5715                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler Unix v21.6.0 Tue May  9 11:00:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  111

    5716                      .dwattr $C$DW$318, DW_AT_name("gh_magVect")
    5717                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5718                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5719                      .dwattr $C$DW$318, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5720                      .dwattr $C$DW$318, DW_AT_decl_line(0x42)
    5721                      .dwattr $C$DW$318, DW_AT_decl_column(0x10)
    5722              
    5723              $C$DW$319       .dwtag  DW_TAG_member
    5724                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    5725                      .dwattr $C$DW$319, DW_AT_name("gh_phaseVect")
    5726                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5727                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5728                      .dwattr $C$DW$319, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5729                      .dwattr $C$DW$319, DW_AT_decl_line(0x43)
    5730                      .dwattr $C$DW$319, DW_AT_decl_column(0x10)
    5731              
    5732              $C$DW$320       .dwtag  DW_TAG_member
    5733                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    5734                      .dwattr $C$DW$320, DW_AT_name("cl_magVect")
    5735                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5736                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5737                      .dwattr $C$DW$320, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5738                      .dwattr $C$DW$320, DW_AT_decl_line(0x44)
    5739                      .dwattr $C$DW$320, DW_AT_decl_column(0x10)
    5740              
    5741              $C$DW$321       .dwtag  DW_TAG_member
    5742                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    5743                      .dwattr $C$DW$321, DW_AT_name("cl_phaseVect")
    5744                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5745                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5746                      .dwattr $C$DW$321, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5747                      .dwattr $C$DW$321, DW_AT_decl_line(0x45)
    5748                      .dwattr $C$DW$321, DW_AT_decl_column(0x10)
    5749              
    5750              $C$DW$322       .dwtag  DW_TAG_member
    5751                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
    5752                      .dwattr $C$DW$322, DW_AT_name("freqVect")
    5753                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5754                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5755                      .dwattr $C$DW$322, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5756                      .dwattr $C$DW$322, DW_AT_decl_line(0x46)
    5757                      .dwattr $C$DW$322, DW_AT_decl_column(0x10)
    5758              
    5759              $C$DW$323       .dwtag  DW_TAG_member
    5760                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    5761                      .dwattr $C$DW$323, DW_AT_name("amplitude")
    5762                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5763                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5764                      .dwattr $C$DW$323, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5765                      .dwattr $C$DW$323, DW_AT_decl_line(0x47)
    5766                      .dwattr $C$DW$323, DW_AT_decl_column(0x0f)
    5767              
    5768              $C$DW$324       .dwtag  DW_TAG_member
    5769                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    5770                      .dwattr $C$DW$324, DW_AT_name("isrFreq")
TMS320C2000 Assembler Unix v21.6.0 Tue May  9 11:00:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  112

    5771                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5772                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5773                      .dwattr $C$DW$324, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5774                      .dwattr $C$DW$324, DW_AT_decl_line(0x48)
    5775                      .dwattr $C$DW$324, DW_AT_decl_column(0x0f)
    5776              
    5777              $C$DW$325       .dwtag  DW_TAG_member
    5778                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    5779                      .dwattr $C$DW$325, DW_AT_name("freqStart")
    5780                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5781                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5782                      .dwattr $C$DW$325, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5783                      .dwattr $C$DW$325, DW_AT_decl_line(0x49)
    5784                      .dwattr $C$DW$325, DW_AT_decl_column(0x0f)
    5785              
    5786              $C$DW$326       .dwtag  DW_TAG_member
    5787                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    5788                      .dwattr $C$DW$326, DW_AT_name("freqStep")
    5789                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5790                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5791                      .dwattr $C$DW$326, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5792                      .dwattr $C$DW$326, DW_AT_decl_line(0x4a)
    5793                      .dwattr $C$DW$326, DW_AT_decl_column(0x0f)
    5794              
    5795              $C$DW$327       .dwtag  DW_TAG_member
    5796                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$22)
    5797                      .dwattr $C$DW$327, DW_AT_name("start")
    5798                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5799                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5800                      .dwattr $C$DW$327, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5801                      .dwattr $C$DW$327, DW_AT_decl_line(0x4b)
    5802                      .dwattr $C$DW$327, DW_AT_decl_column(0x0d)
    5803              
    5804              $C$DW$328       .dwtag  DW_TAG_member
    5805                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$22)
    5806                      .dwattr $C$DW$328, DW_AT_name("state")
    5807                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5808                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5809                      .dwattr $C$DW$328, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5810                      .dwattr $C$DW$328, DW_AT_decl_line(0x4c)
    5811                      .dwattr $C$DW$328, DW_AT_decl_column(0x0d)
    5812              
    5813              $C$DW$329       .dwtag  DW_TAG_member
    5814                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$22)
    5815                      .dwattr $C$DW$329, DW_AT_name("status")
    5816                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5817                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5818                      .dwattr $C$DW$329, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5819                      .dwattr $C$DW$329, DW_AT_decl_line(0x4d)
    5820                      .dwattr $C$DW$329, DW_AT_decl_column(0x0d)
    5821              
    5822              $C$DW$330       .dwtag  DW_TAG_member
    5823                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$22)
    5824                      .dwattr $C$DW$330, DW_AT_name("vecLength")
    5825                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TMS320C2000 Assembler Unix v21.6.0 Tue May  9 11:00:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  113

    5826                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5827                      .dwattr $C$DW$330, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5828                      .dwattr $C$DW$330, DW_AT_decl_line(0x4e)
    5829                      .dwattr $C$DW$330, DW_AT_decl_column(0x0d)
    5830              
    5831              $C$DW$331       .dwtag  DW_TAG_member
    5832                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$22)
    5833                      .dwattr $C$DW$331, DW_AT_name("freqIndex")
    5834                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5835                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5836                      .dwattr $C$DW$331, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5837                      .dwattr $C$DW$331, DW_AT_decl_line(0x4f)
    5838                      .dwattr $C$DW$331, DW_AT_decl_column(0x0d)
    5839              
    5840              $C$DW$332       .dwtag  DW_TAG_member
    5841                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$22)
    5842                      .dwattr $C$DW$332, DW_AT_name("storeH")
    5843                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5844                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5845                      .dwattr $C$DW$332, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5846                      .dwattr $C$DW$332, DW_AT_decl_line(0x50)
    5847                      .dwattr $C$DW$332, DW_AT_decl_column(0x0d)
    5848              
    5849              $C$DW$333       .dwtag  DW_TAG_member
    5850                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$22)
    5851                      .dwattr $C$DW$333, DW_AT_name("storeGH")
    5852                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5853                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5854                      .dwattr $C$DW$333, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5855                      .dwattr $C$DW$333, DW_AT_decl_line(0x51)
    5856                      .dwattr $C$DW$333, DW_AT_decl_column(0x0d)
    5857              
    5858              $C$DW$334       .dwtag  DW_TAG_member
    5859                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$22)
    5860                      .dwattr $C$DW$334, DW_AT_name("storeCL")
    5861                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5862                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5863                      .dwattr $C$DW$334, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5864                      .dwattr $C$DW$334, DW_AT_decl_line(0x52)
    5865                      .dwattr $C$DW$334, DW_AT_decl_column(0x0d)
    5866              
    5867              $C$DW$335       .dwtag  DW_TAG_member
    5868                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$22)
    5869                      .dwattr $C$DW$335, DW_AT_name("speed")
    5870                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5871                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5872                      .dwattr $C$DW$335, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary/
    5873                      .dwattr $C$DW$335, DW_AT_decl_line(0x53)
    5874                      .dwattr $C$DW$335, DW_AT_decl_column(0x0d)
    5875              
    5876                      .dwattr $C$DW$T$23, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary
    5877                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    5878                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    5879                      .dwendtag $C$DW$T$23
    5880              
TMS320C2000 Assembler Unix v21.6.0 Tue May  9 11:00:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  114

    5881                      .dwendtag $C$DW$TU$23
    5882              
    5883              
    5884              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5885                      .dwmtype  $C$DW$T$28
    5886              $C$DW$T$28      .dwtag  DW_TAG_typedef
    5887                      .dwattr $C$DW$T$28, DW_AT_name("SFRA_F32")
    5888                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    5889                      .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/michaelsolomentsev/Documents/CCS/MPPT_PSFB_F28004_primary
    5890                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x54)
    5891                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x02)
    5892              
    5893                      .dwendtag $C$DW$TU$28
    5894              
    5895              
    5896              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5897                      .dwmtype  $C$DW$T$29
    5898              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    5899                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    5900                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    5901              
    5902                      .dwendtag $C$DW$TU$29
    5903              
    5904              
    5905              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5906                      .dwmtype  $C$DW$T$30
    5907              $C$DW$336       .dwtag  DW_TAG_TI_far_type
    5908                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
    5909              
    5910              $C$DW$T$30      .dwtag  DW_TAG_const_type
    5911                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$336)
    5912              
    5913                      .dwendtag $C$DW$TU$30
    5914              
    5915              
    5916              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    5917                      .dwmtype  $C$DW$T$2
    5918              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    5919                      .dwattr $C$DW$T$2, DW_AT_name("void")
    5920              
    5921                      .dwendtag $C$DW$TU$2
    5922              
    5923              
    5924              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    5925                      .dwmtype  $C$DW$T$51
    5926              
    5927              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    5928                      .dwendtag $C$DW$T$51
    5929              
    5930                      .dwendtag $C$DW$TU$51
    5931              
    5932              
    5933              $C$DW$TU$52     .dwtag  DW_TAG_type_unit
    5934                      .dwmtype  $C$DW$T$52
    5935              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler Unix v21.6.0 Tue May  9 11:00:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  115

    5936                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
